# use sweet_factory;
# insert into `equipment` (title) values ('mixer'), ('blender'), ('oven'), ('kitchen scales'), ('waffle iron');

# INSERT INTO staff VALUES
    /*(1, 'Алексеева','Людмила','Михайловна','Администратор','1986-12-13 00:00:00','2010-05-01 00:00:00',30000),
    (2, 'Андреев','Леонид','Николаевич','Бухгалтер','1974-08-24 00:00:00','2012-08-14 00:00:00',20000),
    (3,'Васильев','Александр','Александрович','Технолог-кондитер','1988-12-15 00:00:00','2015-04-01 00:00:00',25000),
    (4,'Иванов','Сергей','Борисович','Пекарь','1968-12-08 00:00:00','2013-05-03 00:00:00',27000),
    (5,'Кузнецова','Екатерина','Олеговна','Повар-кондитер','1952-02-19 00:00:00','2018-10-17 00:00:00',20000),
    (6,'Лебедева','Анастасия','Дмитриевна','Повар-кондитер','1963-08-30 00:00:00','2011-10-17 00:00:00',20000),
    (7,'Михайлов','Глеб','Константинович','Повар-кондитер','1958-09-19 00:00:00','2010-01-02 00:00:00',20000),
    (8,'Новикова','Наталья','Александровна','Декоратор','1955-03-04 00:00:00','2014-03-05 00:00:00',24000),
    (9,'Петров','Владимир ','Владимирович','Пекарь','1963-12-02 00:00:00','2014-11-15 00:00:00',28000),
    (10,'Попова','Светлана','Владмировна','Уборщица-посудомойка','1960-05-29 00:00:00','2013-05-01 00:00:00',15000); 
    
    
update `products_ingredients` set `quantity` = ROUND(rand()*3, 2) WHERE product_id > 0;

update `equipment` set `price` =  ROUND(10000 + rand()*5000, 2) WHERE id > 0 */

#insert into `equipment_technologies` (equipment_id, technology_id) values (1,1), (2,2), (3,3), (4,7),(5,3);
#UPDATE `equipment_technologies` SET technology_id = null;
# insert into `equipment_technologies` (equipment_id, technology_id) values (2,5);


